cmsis-svd/cmsis-svd/data/SiliconLabs/EZR32WG230F64R61.svd
        <register>
          <name>CH8_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USARTRF0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1</name>
                  <description>I2C 1</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER3</name>
                  <description>Timer 3</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <description>Universal Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Low Energy Sensor Interface</description>
                  <value>0x00000032</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USARTRF0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1</name>
                  <description>I2C 1</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER3</name>
                  <description>Timer 3</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <description>Universal Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Low Energy Sensor Interface</description>
                  <value>0x00000032</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x1128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USARTRF0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1</name>
                  <description>I2C 1</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER3</name>
                  <description>Timer 3</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <description>Universal Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Low Energy Sensor Interface</description>
                  <value>0x00000032</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x112C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F000F</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USARTRF0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART1</name>
                  <description>Low Energy UART 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1</name>
                  <description>I2C 1</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER2</name>
                  <description>Timer 2</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER3</name>
                  <description>Timer 3</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <description>Universal Asynchronous Receiver/Transmitter 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <description>Universal Asynchronous Receiver/Transmitter 1</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Advanced Encryption Standard Accelerator</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Low Energy Sensor Interface</description>
                  <value>0x00000032</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
